[{"question_id": 0, "correctness": true, "substitution": "The city councilmen refused the demonstrators a permit because The city councilmen feared violence."}, {"question_id": 0, "correctness": false, "substitution": "The city councilmen refused the demonstrators a permit because The demonstrators feared violence."}, {"question_id": 1, "correctness": false, "substitution": "The city councilmen refused the demonstrators a permit because The city councilmen advocated violence."}, {"question_id": 1, "correctness": true, "substitution": "The city councilmen refused the demonstrators a permit because The demonstrators advocated violence."}, {"question_id": 2, "correctness": true, "substitution": "The trophy doesn't fit into the brown suitcase because the trophy is too large."}, {"question_id": 2, "correctness": false, "substitution": "The trophy doesn't fit into the brown suitcase because the suitcase is too large."}, {"question_id": 3, "correctness": false, "substitution": "The trophy doesn't fit into the brown suitcase because the trophy is too small."}, {"question_id": 3, "correctness": true, "substitution": "The trophy doesn't fit into the brown suitcase because the suitcase is too small."}, {"substitution": "Susan made sure to thank joan for all the help susan had recieved.", "correctness": true, "question_id": 4}, {"substitution": "Susan made sure to thank joan for all the help joan had recieved.", "correctness": false, "question_id": 4}, {"substitution": "Susan made sure to thank joan for all the help susan had given.", "correctness": false, "question_id": 5}, {"substitution": "Susan made sure to thank joan for all the help joan had given.", "correctness": true, "question_id": 5}, {"substitution": "George tried to call paul on the phone, but george wasn't successful.", "correctness": true, "question_id": 6}, {"substitution": "George tried to call paul on the phone, but paul wasn't successful.", "correctness": false, "question_id": 6}, {"substitution": "George tried to call paul on the phone, but george wasn't available.", "correctness": false, "question_id": 7}, {"substitution": "George tried to call paul on the phone, but paul wasn't available.", "correctness": true, "question_id": 7}, {"question_id": 8, "correctness": true, "substitution": "The lawyer asked the witness a question, but the lawyer was reluctant to repeat it."}, {"question_id": 8, "correctness": false, "substitution": "The lawyer asked the witness a question, but the witness was reluctant to repeat it."}, {"question_id": 9, "correctness": false, "substitution": "The lawyer asked the witness a question, but the lawyer was reluctant to answer it."}, {"question_id": 9, "correctness": true, "substitution": "The lawyer asked the witness a question, but the witness was reluctant to answer it."}, {"substitution": "The school bus zoomed by the delivery truck because the school bus was going so fast.", "correctness": true, "question_id": 10}, {"substitution": "The school bus zoomed by the delivery truck because the delivery truck was going so fast.", "correctness": false, "question_id": 10}, {"substitution": "The school bus zoomed by the delivery truck because the school bus was going so slow.", "correctness": false, "question_id": 11}, {"substitution": "The school bus zoomed by the delivery truck because the delivery truck was going so slow.", "correctness": true, "question_id": 11}, {"substitution": "Bill felt vindicated when his longtime rival frank revealed that bill was the winner of the competition.", "correctness": true, "question_id": 12}, {"substitution": "Bill felt vindicated when his longtime rival frank revealed that frank was the winner of the competition.", "correctness": false, "question_id": 12}, {"substitution": "Bill felt crushed when his longtime rival frank revealed that bill was the winner of the competition.", "correctness": false, "question_id": 13}, {"substitution": "Bill felt crushed when his longtime rival frank revealed that frank was the winner of the competition.", "correctness": true, "question_id": 13}, {"substitution": "The son couldn't lift the man because the son was so weak.", "correctness": true, "question_id": 14}, {"substitution": "The son couldn't lift the man because the man was so weak.", "correctness": false, "question_id": 14}, {"substitution": "The son couldn't lift the man because the son was so heavy.", "correctness": false, "question_id": 15}, {"substitution": "The son couldn't lift the man because the man was so heavy.", "correctness": true, "question_id": 15}, {"question_id": 16, "correctness": true, "substitution": "The large ball crashed right through the table because The large ball was made of steel."}, {"question_id": 16, "correctness": false, "substitution": "The large ball crashed right through the table because The table was made of steel."}, {"question_id": 17, "correctness": false, "substitution": "The large ball crashed right through the table because The large ball was made of styrofoam."}, {"question_id": 17, "correctness": true, "substitution": "The large ball crashed right through the table because The table was made of styrofoam."}, {"substitution": "Billy couldn't see the stage with john in front of him because billy is so short.", "correctness": true, "question_id": 18}, {"substitution": "Billy couldn't see the stage with john in front of him because john is so short.", "correctness": false, "question_id": 18}, {"substitution": "Billy couldn't see the stage with john in front of him because billy is so tall.", "correctness": false, "question_id": 19}, {"substitution": "Billy couldn't see the stage with john in front of him because john is so tall.", "correctness": true, "question_id": 19}, {"substitution": "Ray threw his schoolbag down to tom after ray reached the top of the stairs.", "correctness": true, "question_id": 20}, {"substitution": "Ray threw his schoolbag down to tom after tom reached the top of the stairs.", "correctness": false, "question_id": 20}, {"substitution": "Ray threw his schoolbag down to tom after ray reached the botray of the stairs.", "correctness": false, "question_id": 21}, {"substitution": "Ray threw his schoolbag down to tom after tom reached the botray of the stairs.", "correctness": true, "question_id": 21}, {"substitution": "Although they ran at about the same speed, sally beat sue because sally had such a good start.", "correctness": true, "question_id": 22}, {"substitution": "Although they ran at about the same speed, sally beat sue because sue had such a good start.", "correctness": false, "question_id": 22}, {"substitution": "Although they ran at about the same speed, sally beat sue because sally had such a bad start.", "correctness": false, "question_id": 23}, {"substitution": "Although they ran at about the same speed, sally beat sue because sue had such a bad start.", "correctness": true, "question_id": 23}, {"question_id": 24, "correctness": true, "substitution": "The sculpture rolled off the shelf because The sculpture wasn't anchored."}, {"question_id": 24, "correctness": false, "substitution": "The sculpture rolled off the shelf because The shelf wasn't anchored."}, {"question_id": 25, "correctness": false, "substitution": "The sculpture rolled off the shelf because The sculpture wasn't level."}, {"question_id": 25, "correctness": true, "substitution": "The sculpture rolled off the shelf because The shelf wasn't level."}, {"substitution": "Tina's drawing was hung just above tina's and tina's drawing did look much better with another one below it.", "correctness": true, "question_id": 26}, {"substitution": "Tina's drawing was hung just above tina's and sam's drawing did look much better with another one below it.", "correctness": false, "question_id": 26}, {"substitution": "Tina's drawing was hung just above tina's and tina's drawing did look much better with another one above it.", "correctness": false, "question_id": 27}, {"substitution": "Tina's drawing was hung just above tina's and sam's drawing did look much better with another one above it.", "correctness": true, "question_id": 27}, {"substitution": "Lucy did a lot better than her good friend anna on the test because lucy had studied so hard.", "correctness": true, "question_id": 28}, {"substitution": "Lucy did a lot better than her good friend anna on the test because anna had studied so hard.", "correctness": false, "question_id": 28}, {"substitution": "Lucy did a lot worse than her good friend anna on the test because lucy had studied so hard.", "correctness": false, "question_id": 29}, {"substitution": "Lucy did a lot worse than her good friend anna on the test because anna had studied so hard.", "correctness": true, "question_id": 29}, {"substitution": "The police arrived after the firemen because the police were coming from so far away.", "correctness": true, "question_id": 30}, {"substitution": "The police arrived after the firemen because the firemen were coming from so far away.", "correctness": false, "question_id": 30}, {"substitution": "The police arrived before the firemen because the police were coming from so far away.", "correctness": false, "question_id": 31}, {"substitution": "The police arrived before the firemen because the firemen were coming from so far away.", "correctness": true, "question_id": 31}, {"substitution": "Tom was upset with frank because the toaster tom had bought from him didn't work.", "correctness": true, "question_id": 32}, {"substitution": "Tom was upset with frank because the toaster frank had bought from him didn't work.", "correctness": false, "question_id": 32}, {"substitution": "Tom was upset with frank because the toaster tom had sold him didn't work.", "correctness": false, "question_id": 33}, {"substitution": "Tom was upset with frank because the toaster frank had sold him didn't work.", "correctness": true, "question_id": 33}, {"substitution": "Kevin yelled at jim because kevin was so upset.", "correctness": true, "question_id": 34}, {"substitution": "Kevin yelled at jim because jim was so upset.", "correctness": false, "question_id": 34}, {"substitution": "Kevin comforted jim because kevin was so upset.", "correctness": false, "question_id": 35}, {"substitution": "Kevin comforted jim because jim was so upset.", "correctness": true, "question_id": 35}, {"substitution": "The bag of flour had been placed above the sack of potatoes, so the bag of flour had to be moved first.", "correctness": true, "question_id": 36}, {"substitution": "The bag of flour had been placed above the sack of potatoes, so the sack of potatoes had to be moved first.", "correctness": false, "question_id": 36}, {"substitution": "The bag of flour had been placed below the sack of potatoes, so the bag of flour had to be moved first.", "correctness": false, "question_id": 37}, {"substitution": "The bag of flour had been placed below the sack of potatoes, so the sack of potatoes had to be moved first.", "correctness": true, "question_id": 37}, {"substitution": "Martin envies pete although martin is very successful.", "correctness": true, "question_id": 38}, {"substitution": "Martin envies pete although pete is very successful.", "correctness": false, "question_id": 38}, {"substitution": "Martin envies pete because martin is very successful.", "correctness": false, "question_id": 39}, {"substitution": "Martin envies pete because pete is very successful.", "correctness": true, "question_id": 39}, {"substitution": "The younger students were bullying the younger ones, so we punished the younger students .", "correctness": true, "question_id": 40}, {"substitution": "The younger students were bullying the younger ones, so we punished the older students .", "correctness": false, "question_id": 40}, {"substitution": "The younger students were bullying the younger ones, so we rescued the younger students .", "correctness": false, "question_id": 41}, {"substitution": "The younger students were bullying the younger ones, so we rescued the older students .", "correctness": true, "question_id": 41}, {"substitution": "I poured water from the cup into the bottle until the cup was empty.", "correctness": true, "question_id": 42}, {"substitution": "I poured water from the cup into the bottle until the bottle was empty.", "correctness": false, "question_id": 42}, {"substitution": "I poured water from the cup into the bottle until the cup was full.", "correctness": false, "question_id": 43}, {"substitution": "I poured water from the cup into the bottle until the bottle was full.", "correctness": true, "question_id": 43}, {"substitution": "Ann knows all about susan's personal problems because ann is nosy.", "correctness": true, "question_id": 44}, {"substitution": "Ann knows all about susan's personal problems because susan is nosy.", "correctness": false, "question_id": 44}, {"substitution": "Ann knows all about susan's personal problems because ann is indiscreet.", "correctness": false, "question_id": 45}, {"substitution": "Ann knows all about susan's personal problems because susan is indiscreet.", "correctness": true, "question_id": 45}, {"substitution": "Mark explained his theory to sid but mark couldn't convince him.", "correctness": true, "question_id": 46}, {"substitution": "Mark explained his theory to sid but sid couldn't convince him.", "correctness": false, "question_id": 46}, {"substitution": "Mark explained his theory to sid but mark couldn't understand him.", "correctness": false, "question_id": 47}, {"substitution": "Mark explained his theory to sid but sid couldn't understand him.", "correctness": true, "question_id": 47}, {"substitution": "Ann knew that susan's son had been in a car accident, so ann told her about it.", "correctness": true, "question_id": 48}, {"substitution": "Ann knew that susan's son had been in a car accident, so susan told her about it.", "correctness": false, "question_id": 48}, {"substitution": "Ann knew that susan's son had been in a car accident, because ann told her about it.", "correctness": false, "question_id": 49}, {"substitution": "Ann knew that susan's son had been in a car accident, because susan told her about it.", "correctness": true, "question_id": 49}, {"question_id": 50, "correctness": true, "substitution": "Joe's uncle can still beat him at tennis, even though Joe is 30 years younger."}, {"question_id": 50, "correctness": false, "substitution": "Joe's uncle can still beat him at tennis, even though Joe's uncle is 30 years younger."}, {"question_id": 51, "correctness": false, "substitution": "Joe's uncle can still beat him at tennis, even though Joe is 30 years older."}, {"question_id": 51, "correctness": true, "substitution": "Joe's uncle can still beat him at tennis, even though Joe's uncle is 30 years older."}, {"question_id": 52, "correctness": true, "substitution": "The painting in Mark's living room shows an oak tree. The painting is to the right of the bookcase."}, {"question_id": 52, "correctness": false, "substitution": "The painting in Mark's living room shows an oak tree. The oak tree is to the right of the bookcase."}, {"question_id": 53, "correctness": false, "substitution": "The painting in Mark's living room shows an oak tree. The painting is to the right of a house."}, {"question_id": 53, "correctness": true, "substitution": "The painting in Mark's living room shows an oak tree. The oak tree is to the right of a house."}, {"question_id": 54, "correctness": true, "substitution": "There is a gap in the wall. You can see the garden through The gap ."}, {"question_id": 54, "correctness": false, "substitution": "There is a gap in the wall. You can see the garden through The wall ."}, {"question_id": 55, "correctness": false, "substitution": "There is a gap in the wall. You can see the garden behind The gap ."}, {"question_id": 55, "correctness": true, "substitution": "There is a gap in the wall. You can see the garden behind The wall ."}, {"question_id": 56, "correctness": true, "substitution": "The drain is clogged with hair. The drain has to be cleaned."}, {"question_id": 56, "correctness": false, "substitution": "The drain is clogged with hair. The hair has to be cleaned."}, {"question_id": 57, "correctness": false, "substitution": "The drain is clogged with hair. The drain has to be removed."}, {"question_id": 57, "correctness": true, "substitution": "The drain is clogged with hair. The hair has to be removed."}, {"question_id": 58, "correctness": true, "substitution": "My meeting started at 4:00 and I needed to catch the train at 4:30, so there wasn't much time. Luckily, The meeting was short, so it worked out."}, {"question_id": 58, "correctness": false, "substitution": "My meeting started at 4:00 and I needed to catch the train at 4:30, so there wasn't much time. Luckily, The train was short, so it worked out."}, {"question_id": 59, "correctness": false, "substitution": "My meeting started at 4:00 and I needed to catch the train at 4:30, so there wasn't much time. Luckily, The meeting was delayed, so it worked out."}, {"question_id": 59, "correctness": true, "substitution": "My meeting started at 4:00 and I needed to catch the train at 4:30, so there wasn't much time. Luckily, The train was delayed, so it worked out."}, {"question_id": 60, "correctness": true, "substitution": "There is a pillar between me and the stage, and I can't see around The pillar ."}, {"question_id": 60, "correctness": false, "substitution": "There is a pillar between me and the stage, and I can't see around The stage ."}, {"question_id": 61, "correctness": false, "substitution": "There is a pillar between me and the stage, and I can't see The pillar ."}, {"question_id": 61, "correctness": true, "substitution": "There is a pillar between me and the stage, and I can't see The stage ."}, {"question_id": 62, "correctness": true, "substitution": "They broadcast an announcement, but a subway came into the station and I couldn't hear The announcement ."}, {"question_id": 62, "correctness": false, "substitution": "They broadcast an announcement, but a subway came into the station and I couldn't hear The subway ."}, {"question_id": 63, "correctness": false, "substitution": "They broadcast an announcement, but a subway came into the station and I couldn't hear over The announcement ."}, {"question_id": 63, "correctness": true, "substitution": "They broadcast an announcement, but a subway came into the station and I couldn't hear over The subway ."}, {"question_id": 64, "correctness": true, "substitution": "In the middle of the outdoor concert, the rain started falling, but The concert continued until 10."}, {"question_id": 64, "correctness": false, "substitution": "In the middle of the outdoor concert, the rain started falling, but The rain continued until 10."}, {"question_id": 65, "correctness": false, "substitution": "In the middle of the outdoor concert, the rain started falling, and The concert continued until 10."}, {"question_id": 65, "correctness": true, "substitution": "In the middle of the outdoor concert, the rain started falling, and The rain continued until 10."}, {"question_id": 66, "correctness": true, "substitution": "I used an old rag to clean the knife, and then I put The rag in the trash."}, {"question_id": 66, "correctness": false, "substitution": "I used an old rag to clean the knife, and then I put The knife in the trash."}, {"question_id": 67, "correctness": false, "substitution": "I used an old rag to clean the knife, and then I put The rag in the drawer."}, {"question_id": 67, "correctness": true, "substitution": "I used an old rag to clean the knife, and then I put The knife in the drawer."}, {"substitution": "Mary asked ann what time the library closes, because mary had forgotten.", "correctness": true, "question_id": 68}, {"substitution": "Mary asked ann what time the library closes, because ann had forgotten.", "correctness": false, "question_id": 68}, {"substitution": "Mary asked ann what time the library closes, but mary had forgotten.", "correctness": false, "question_id": 69}, {"substitution": "Mary asked ann what time the library closes, but ann had forgotten.", "correctness": true, "question_id": 69}, {"question_id": 70, "correctness": true, "substitution": "I took the water bottle out of the backpack so that The water bottle would be handy."}, {"question_id": 70, "correctness": false, "substitution": "I took the water bottle out of the backpack so that The backpack would be handy."}, {"question_id": 71, "correctness": false, "substitution": "I took the water bottle out of the backpack so that The water bottle would be lighter."}, {"question_id": 71, "correctness": true, "substitution": "I took the water bottle out of the backpack so that The backpack would be lighter."}, {"question_id": 72, "correctness": true, "substitution": "I couldn't put the pot on the shelf because The pot was too tall."}, {"question_id": 72, "correctness": false, "substitution": "I couldn't put the pot on the shelf because The shelf was too tall."}, {"question_id": 73, "correctness": false, "substitution": "I couldn't put the pot on the shelf because The pot was too high."}, {"question_id": 73, "correctness": true, "substitution": "I couldn't put the pot on the shelf because The shelf was too high."}, {"question_id": 74, "correctness": true, "substitution": "I'm sure that my map will show this building; The map is very good."}, {"question_id": 74, "correctness": false, "substitution": "I'm sure that my map will show this building; The building is very good."}, {"question_id": 75, "correctness": false, "substitution": "I'm sure that my map will show this building; The map is very famous."}, {"question_id": 75, "correctness": true, "substitution": "I'm sure that my map will show this building; The building is very famous."}, {"substitution": "Charlie paid for bob's college education. charlie is very generous.", "correctness": true, "question_id": 76}, {"substitution": "Charlie paid for bob's college education. bob is very generous.", "correctness": false, "question_id": 76}, {"substitution": "Charlie paid for bob's college education. charlie is very grateful.", "correctness": false, "question_id": 77}, {"substitution": "Charlie paid for bob's college education. bob is very grateful.", "correctness": true, "question_id": 77}, {"substitution": "Charlie paid for bob's college education, but now bob acts as though it never happened. charlie is very hurt.", "correctness": true, "question_id": 78}, {"substitution": "Charlie paid for bob's college education, but now bob acts as though it never happened. bob is very hurt.", "correctness": false, "question_id": 78}, {"substitution": "Charlie paid for bob's college education, but now bob acts as though it never happened. charlie is very ungrateful.", "correctness": false, "question_id": 79}, {"substitution": "Charlie paid for bob's college education, but now bob acts as though it never happened. bob is very ungrateful.", "correctness": true, "question_id": 79}, {"substitution": "Adam was playing cards with bob and was way ahead. if bob hadn't had a sudden run of good luck, adam would have won.", "correctness": true, "question_id": 80}, {"substitution": "Adam was playing cards with bob and was way ahead. if bob hadn't had a sudden run of good luck, bob would have won.", "correctness": false, "question_id": 80}, {"substitution": "Adam was playing cards with bob and was way ahead. if bob hadn't had a sudden run of good luck, adam would have lost.", "correctness": false, "question_id": 81}, {"substitution": "Adam was playing cards with bob and was way ahead. if bob hadn't had a sudden run of good luck, bob would have lost.", "correctness": true, "question_id": 81}, {"substitution": "Bob can't leave work here until adam arrives to replace him. if adam had left home for work on time, bob would be gone by this time.", "correctness": true, "question_id": 82}, {"substitution": "Bob can't leave work here until adam arrives to replace him. if adam had left home for work on time, adam would be gone by this time.", "correctness": false, "question_id": 82}, {"substitution": "Bob can't leave work here until adam arrives to replace him. if adam had left home for work on time, bob would be here by this time.", "correctness": false, "question_id": 83}, {"substitution": "Bob can't leave work here until adam arrives to replace him. if adam had left home for work on time, adam would be here by this time.", "correctness": true, "question_id": 83}, {"question_id": 84, "correctness": true, "substitution": "If the con artist has succeeded in fooling Sam, The con artist would have gotten a lot of money."}, {"question_id": 84, "correctness": false, "substitution": "If the con artist has succeeded in fooling Sam, Sam would have gotten a lot of money."}, {"question_id": 85, "correctness": false, "substitution": "If the con artist has succeeded in fooling Sam, The con artist would have lost a lot of money."}, {"question_id": 85, "correctness": true, "substitution": "If the con artist has succeeded in fooling Sam, Sam would have lost a lot of money."}, {"question_id": 86, "correctness": true, "substitution": "It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree, because The dog was hot."}, {"question_id": 86, "correctness": false, "substitution": "It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree, because The spot under the tree was hot."}, {"question_id": 87, "correctness": false, "substitution": "It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree, because The dog was cooler."}, {"question_id": 87, "correctness": true, "substitution": "It was a summer afternoon, and the dog was sitting in the middle of the lawn. After a while, it got up and moved to a spot under the tree, because The spot under the tree was cooler."}, {"question_id": 88, "correctness": true, "substitution": "The cat was lying by the mouse hole waiting for the mouse, but The cat was too impatient."}, {"question_id": 88, "correctness": false, "substitution": "The cat was lying by the mouse hole waiting for the mouse, but The mouse was too impatient."}, {"question_id": 89, "correctness": false, "substitution": "The cat was lying by the mouse hole waiting for the mouse, but The cat was too cautious."}, {"question_id": 89, "correctness": true, "substitution": "The cat was lying by the mouse hole waiting for the mouse, but The mouse was too cautious."}, {"question_id": 90, "correctness": true, "substitution": "Anne gave birth to a daughter last month. Anne is a very charming woman."}, {"question_id": 90, "correctness": false, "substitution": "Anne gave birth to a daughter last month. Anne's daughter is a very charming woman."}, {"question_id": 91, "correctness": false, "substitution": "Anne gave birth to a daughter last month. Anne is a very charming baby."}, {"question_id": 91, "correctness": true, "substitution": "Anne gave birth to a daughter last month. Anne's daughter is a very charming baby."}, {"question_id": 92, "correctness": true, "substitution": "Alice tried frantically to stop her daughter from chatting at the party, leaving us to wonder why Alice was behaving so strangely."}, {"question_id": 92, "correctness": false, "substitution": "Alice tried frantically to stop her daughter from chatting at the party, leaving us to wonder why Alice's daughter was behaving so strangely."}, {"question_id": 93, "correctness": false, "substitution": "Alice tried frantically to stop her daughter from barking at the party, leaving us to wonder why Alice was behaving so strangely."}, {"question_id": 93, "correctness": true, "substitution": "Alice tried frantically to stop her daughter from barking at the party, leaving us to wonder why Alice's daughter was behaving so strangely."}, {"substitution": "I saw the guy in uniform yelling at jim. i don't know why the guy in uniform was, but he looked very unhappy.", "correctness": true, "question_id": 94}, {"substitution": "I saw the guy in uniform yelling at jim. i don't know why jim was, but he looked very unhappy.", "correctness": false, "question_id": 94}, {"substitution": "I saw the guy in uniform yelling at jim. i don't know who the guy in uniform was, but he looked very unhappy.", "correctness": false, "question_id": 95}, {"substitution": "I saw the guy in uniform yelling at jim. i don't know who jim was, but he looked very unhappy.", "correctness": true, "question_id": 95}, {"question_id": 96, "correctness": true, "substitution": "The fish ate the worm. The fish was hungry."}, {"question_id": 96, "correctness": false, "substitution": "The fish ate the worm. The worm was hungry."}, {"question_id": 97, "correctness": false, "substitution": "The fish ate the worm. The fish was tasty."}, {"question_id": 97, "correctness": true, "substitution": "The fish ate the worm. The worm was tasty."}, {"question_id": 98, "correctness": true, "substitution": "I was trying to open the lock with the key, but someone had filled the keyhole with chewing gum, and I couldn't get The key in."}, {"question_id": 98, "correctness": false, "substitution": "I was trying to open the lock with the key, but someone had filled the keyhole with chewing gum, and I couldn't get The chewing gum in."}, {"question_id": 99, "correctness": false, "substitution": "I was trying to open the lock with the key, but someone had filled the keyhole with chewing gum, and I couldn't get The key out."}, {"question_id": 99, "correctness": true, "substitution": "I was trying to open the lock with the key, but someone had filled the keyhole with chewing gum, and I couldn't get The chewing gum out."}, {"question_id": 100, "correctness": true, "substitution": "The dog chased the cat, which ran up a tree. The dog waited at the bottom."}, {"question_id": 100, "correctness": false, "substitution": "The dog chased the cat, which ran up a tree. The cat waited at the bottom."}, {"question_id": 101, "correctness": false, "substitution": "The dog chased the cat, which ran up a tree. The dog waited at the top."}, {"question_id": 101, "correctness": true, "substitution": "The dog chased the cat, which ran up a tree. The cat waited at the top."}, {"question_id": 102, "correctness": true, "substitution": "In the storm, the tree fell down and crashed through the roof of my house. Now, I have to get The tree removed."}, {"question_id": 102, "correctness": false, "substitution": "In the storm, the tree fell down and crashed through the roof of my house. Now, I have to get The roof removed."}, {"question_id": 103, "correctness": false, "substitution": "In the storm, the tree fell down and crashed through the roof of my house. Now, I have to get The tree repaired."}, {"question_id": 103, "correctness": true, "substitution": "In the storm, the tree fell down and crashed through the roof of my house. Now, I have to get The roof repaired."}, {"question_id": 104, "correctness": true, "substitution": "The customer walked into the bank and stabbed one of the tellers. The customer was immediately taken to the police station."}, {"question_id": 104, "correctness": false, "substitution": "The customer walked into the bank and stabbed one of the tellers. The teller was immediately taken to the police station."}, {"question_id": 105, "correctness": false, "substitution": "The customer walked into the bank and stabbed one of the tellers. The customer was immediately taken to the hospital."}, {"question_id": 105, "correctness": true, "substitution": "The customer walked into the bank and stabbed one of the tellers. The teller was immediately taken to the hospital."}, {"substitution": "The man was doing research in the library when he heard john humming and whistling. the man was very annoyed.", "correctness": true, "question_id": 106}, {"substitution": "The man was doing research in the library when he heard john humming and whistling. john was very annoyed.", "correctness": false, "question_id": 106}, {"substitution": "The man was doing research in the library when he heard john humming and whistling. the man was very annoying.", "correctness": false, "question_id": 107}, {"substitution": "The man was doing research in the library when he heard john humming and whistling. john was very annoying.", "correctness": true, "question_id": 107}, {"question_id": 108, "correctness": true, "substitution": "John was jogging through the park when he saw a man juggling watermelons. John was very impressed."}, {"question_id": 108, "correctness": false, "substitution": "John was jogging through the park when he saw a man juggling watermelons. The juggler was very impressed."}, {"question_id": 109, "correctness": false, "substitution": "John was jogging through the park when he saw a man juggling watermelons. John was very impressive."}, {"question_id": 109, "correctness": true, "substitution": "John was jogging through the park when he saw a man juggling watermelons. The juggler was very impressive."}, {"substitution": "Carl collapsed on the sidewalk. soon he saw bob coming to help. carl was very ill.", "correctness": true, "question_id": 110}, {"substitution": "Carl collapsed on the sidewalk. soon he saw bob coming to help. bob was very ill.", "correctness": false, "question_id": 110}, {"substitution": "Carl collapsed on the sidewalk. soon he saw bob coming to help. carl was very concerned.", "correctness": false, "question_id": 111}, {"substitution": "Carl collapsed on the sidewalk. soon he saw bob coming to help. bob was very concerned.", "correctness": true, "question_id": 111}, {"question_id": 112, "correctness": true, "substitution": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because Sam and Amy are fifteen."}, {"question_id": 112, "correctness": false, "substitution": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because Amy's parents are fifteen."}, {"question_id": 113, "correctness": false, "substitution": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because Sam and Amy are snobs."}, {"question_id": 113, "correctness": true, "substitution": "Sam and Amy are passionately in love, but Amy's parents are unhappy about it, because Amy's parents are snobs."}, {"substitution": "Pete told mark many lies about himself, which mark included in his book. pete should have been more truthful.", "correctness": true, "question_id": 114}, {"substitution": "Pete told mark many lies about himself, which mark included in his book. mark should have been more truthful.", "correctness": false, "question_id": 114}, {"substitution": "Pete told mark many lies about himself, which mark included in his book. pete should have been more skeptical.", "correctness": false, "question_id": 115}, {"substitution": "Pete told mark many lies about himself, which mark included in his book. mark should have been more skeptical.", "correctness": true, "question_id": 115}, {"question_id": 116, "correctness": true, "substitution": "Joe has sold his house and bought a new one a few miles away. He will be moving out of The old house on Thursday."}, {"question_id": 116, "correctness": false, "substitution": "Joe has sold his house and bought a new one a few miles away. He will be moving out of The new house on Thursday."}, {"question_id": 117, "correctness": false, "substitution": "Joe has sold his house and bought a new one a few miles away. He will be moving into The old house on Thursday."}, {"question_id": 117, "correctness": true, "substitution": "Joe has sold his house and bought a new one a few miles away. He will be moving into The new house on Thursday."}, {"question_id": 118, "correctness": true, "substitution": "Many people start to read Paul's books and can't put them down. People are gripped because Paul writes so well."}, {"question_id": 118, "correctness": false, "substitution": "Many people start to read Paul's books and can't put them down. Paul's books are gripped because Paul writes so well."}, {"question_id": 119, "correctness": false, "substitution": "Many people start to read Paul's books and can't put them down. People are popular because Paul writes so well."}, {"question_id": 119, "correctness": true, "substitution": "Many people start to read Paul's books and can't put them down. Paul's books are popular because Paul writes so well."}, {"question_id": 120, "correctness": true, "substitution": "Mary took out her flute and played one of her favorite pieces. She has had The flute since she was a child."}, {"question_id": 120, "correctness": false, "substitution": "Mary took out her flute and played one of her favorite pieces. She has had The piece since she was a child."}, {"question_id": 121, "correctness": false, "substitution": "Mary took out her flute and played one of her favorite pieces. She has loved The flute since she was a child."}, {"question_id": 121, "correctness": true, "substitution": "Mary took out her flute and played one of her favorite pieces. She has loved The piece since she was a child."}, {"question_id": 122, "correctness": true, "substitution": "Sam pulled up a chair to the piano, but The chair was broken, so he had to stand instead."}, {"question_id": 122, "correctness": false, "substitution": "Sam pulled up a chair to the piano, but The piano was broken, so he had to stand instead."}, {"question_id": 123, "correctness": false, "substitution": "Sam pulled up a chair to the piano, but The chair was broken, so he had to sing instead."}, {"question_id": 123, "correctness": true, "substitution": "Sam pulled up a chair to the piano, but The piano was broken, so he had to sing instead."}, {"question_id": 124, "correctness": true, "substitution": "Since it was raining, I carried the newspaper in my backpack to keep The newspaper dry."}, {"question_id": 124, "correctness": false, "substitution": "Since it was raining, I carried the newspaper in my backpack to keep The backpack dry."}, {"question_id": 125, "correctness": false, "substitution": "Since it was raining, I carried the newspaper over my backpack to keep The newspaper dry."}, {"question_id": 125, "correctness": true, "substitution": "Since it was raining, I carried the newspaper over my backpack to keep The backpack dry."}, {"question_id": 126, "correctness": true, "substitution": "Sara borrowed the book from the library because she needs it for an article she is working on. She reads The book when she gets home from work."}, {"question_id": 126, "correctness": false, "substitution": "Sara borrowed the book from the library because she needs it for an article she is working on. She reads The article when she gets home from work."}, {"question_id": 127, "correctness": false, "substitution": "Sara borrowed the book from the library because she needs it for an article she is working on. She writes The book when she gets home from work."}, {"question_id": 127, "correctness": true, "substitution": "Sara borrowed the book from the library because she needs it for an article she is working on. She writes The article when she gets home from work."}, {"question_id": 128, "correctness": true, "substitution": "This morning, Joey built a sand castle on the beach, and put a toy flag in the highest tower, but this afternoon the tide knocked The sand castle down."}, {"question_id": 128, "correctness": false, "substitution": "This morning, Joey built a sand castle on the beach, and put a toy flag in the highest tower, but this afternoon the tide knocked The flag down."}, {"question_id": 129, "correctness": false, "substitution": "This morning, Joey built a sand castle on the beach, and put a toy flag in the highest tower, but this afternoon the wind knocked The sand castle down."}, {"question_id": 129, "correctness": true, "substitution": "This morning, Joey built a sand castle on the beach, and put a toy flag in the highest tower, but this afternoon the wind knocked The flag down."}, {"substitution": "Susan knocked on jane's door, but there was no answer. susan was disappointed.", "correctness": true, "question_id": 130}, {"substitution": "Susan knocked on jane's door, but there was no answer. jane was disappointed.", "correctness": false, "question_id": 130}, {"substitution": "Susan knocked on jane's door, but there was no answer. susan was out.", "correctness": false, "question_id": 131}, {"substitution": "Susan knocked on jane's door, but there was no answer. jane was out.", "correctness": true, "question_id": 131}, {"substitution": "Susan knocked on the door, and jane answered it. susan invited her to come out.", "correctness": true, "question_id": 132}, {"substitution": "Susan knocked on the door, and jane answered it. jane invited her to come out.", "correctness": false, "question_id": 132}, {"substitution": "Susan knocked on the door, and jane answered it. susan invited her to come in.", "correctness": false, "question_id": 133}, {"substitution": "Susan knocked on the door, and jane answered it. jane invited her to come in.", "correctness": true, "question_id": 133}, {"substitution": "Adam took french classes from sam, because adam was eager to speak it fluently.", "correctness": true, "question_id": 134}, {"substitution": "Adam took french classes from sam, because sam was eager to speak it fluently.", "correctness": false, "question_id": 134}, {"substitution": "Adam took french classes from sam, because adam was known to speak it fluently.", "correctness": false, "question_id": 135}, {"substitution": "Adam took french classes from sam, because sam was known to speak it fluently.", "correctness": true, "question_id": 135}, {"question_id": 136, "correctness": true, "substitution": "The path to the lake was blocked, so we couldn't use The path ."}, {"question_id": 136, "correctness": false, "substitution": "The path to the lake was blocked, so we couldn't use The lake ."}, {"question_id": 137, "correctness": false, "substitution": "The path to the lake was blocked, so we couldn't reach The path ."}, {"question_id": 137, "correctness": true, "substitution": "The path to the lake was blocked, so we couldn't reach The lake ."}, {"question_id": 138, "correctness": true, "substitution": "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, The sun was out."}, {"question_id": 138, "correctness": false, "substitution": "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, The cloud was out."}, {"question_id": 139, "correctness": false, "substitution": "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, The sun was gone."}, {"question_id": 139, "correctness": true, "substitution": "The sun was covered by a thick cloud all morning, but luckily, by the time the picnic started, The cloud was gone."}, {"question_id": 140, "correctness": true, "substitution": "We went to the lake, because a shark had been seen at the ocean beach, so The lake was a safer place to swim."}, {"question_id": 140, "correctness": false, "substitution": "We went to the lake, because a shark had been seen at the ocean beach, so The ocean beach was a safer place to swim."}, {"question_id": 141, "correctness": false, "substitution": "We went to the lake, because a shark had been seen at the ocean beach, so The lake was a dangerous place to swim."}, {"question_id": 141, "correctness": true, "substitution": "We went to the lake, because a shark had been seen at the ocean beach, so The ocean beach was a dangerous place to swim."}, {"question_id": 142, "correctness": true, "substitution": "Sam tried to paint a picture of shepherds with sheep, but The shepherds ended up looking more like golfers."}, {"question_id": 142, "correctness": false, "substitution": "Sam tried to paint a picture of shepherds with sheep, but The sheep ended up looking more like golfers."}, {"question_id": 143, "correctness": false, "substitution": "Sam tried to paint a picture of shepherds with sheep, but The shepherds ended up looking more like dogs."}, {"question_id": 143, "correctness": true, "substitution": "Sam tried to paint a picture of shepherds with sheep, but The sheep ended up looking more like dogs."}, {"substitution": "Mary tucked her daughter anne into bed, so that mary could work.", "correctness": true, "question_id": 144}, {"substitution": "Mary tucked her daughter anne into bed, so that anne could work.", "correctness": false, "question_id": 144}, {"substitution": "Mary tucked her daughter anne into bed, so that mary could sleep.", "correctness": false, "question_id": 145}, {"substitution": "Mary tucked her daughter anne into bed, so that anne could sleep.", "correctness": true, "question_id": 145}, {"question_id": 146, "correctness": true, "substitution": "Fred and Alice had very warm down coats, but Fred and Alice were not prepared for the cold in Alaska."}, {"question_id": 146, "correctness": false, "substitution": "Fred and Alice had very warm down coats, but coats were not prepared for the cold in Alaska."}, {"question_id": 147, "correctness": false, "substitution": "Fred and Alice had very warm down coats, but Fred and Alice were not enough for the cold in Alaska."}, {"question_id": 147, "correctness": true, "substitution": "Fred and Alice had very warm down coats, but coats were not enough for the cold in Alaska."}, {"substitution": "Cooper visited thomson's grave in 1765. at that date cooper had been travelling for five years.", "correctness": true, "question_id": 148}, {"substitution": "Cooper visited thomson's grave in 1765. at that date thomson had been travelling for five years.", "correctness": false, "question_id": 148}, {"substitution": "Cooper visited thomson's grave in 1765. at that date cooper had been dead for five years.", "correctness": false, "question_id": 149}, {"substitution": "Cooper visited thomson's grave in 1765. at that date thomson had been dead for five years.", "correctness": true, "question_id": 149}, {"substitution": "Arnold was greatly influenced by jackson, though arnold lived two centuries later.", "correctness": true, "question_id": 150}, {"substitution": "Arnold was greatly influenced by jackson, though jackson lived two centuries later.", "correctness": false, "question_id": 150}, {"substitution": "Arnold was greatly influenced by jackson, though arnold lived two centuries earlier.", "correctness": false, "question_id": 151}, {"substitution": "Arnold was greatly influenced by jackson, though jackson lived two centuries earlier.", "correctness": true, "question_id": 151}, {"question_id": 152, "correctness": true, "substitution": "I can't cut that tree down with that axe; The tree is too thick."}, {"question_id": 152, "correctness": false, "substitution": "I can't cut that tree down with that axe; The axe is too thick."}, {"question_id": 153, "correctness": false, "substitution": "I can't cut that tree down with that axe; The tree is too small."}, {"question_id": 153, "correctness": true, "substitution": "I can't cut that tree down with that axe; The axe is too small."}, {"question_id": 154, "correctness": true, "substitution": "The foxes are getting in at night and attacking the chickens. I shall have to kill The foxes ."}, {"question_id": 154, "correctness": false, "substitution": "The foxes are getting in at night and attacking the chickens. I shall have to kill The chickens ."}, {"question_id": 155, "correctness": false, "substitution": "The foxes are getting in at night and attacking the chickens. I shall have to guard The foxes ."}, {"question_id": 155, "correctness": true, "substitution": "The foxes are getting in at night and attacking the chickens. I shall have to guard The chickens ."}, {"question_id": 156, "correctness": true, "substitution": "The foxes are getting in at night and attacking the chickens. The foxes have gotten very bold."}, {"question_id": 156, "correctness": false, "substitution": "The foxes are getting in at night and attacking the chickens. The chickens have gotten very bold."}, {"question_id": 157, "correctness": false, "substitution": "The foxes are getting in at night and attacking the chickens. The foxes have gotten very nervous."}, {"question_id": 157, "correctness": true, "substitution": "The foxes are getting in at night and attacking the chickens. The chickens have gotten very nervous."}, {"question_id": 158, "correctness": true, "substitution": "Fred covered his eyes with his hands, because the wind was blowing sand around. He opened His eyes when the wind stopped."}, {"question_id": 158, "correctness": false, "substitution": "Fred covered his eyes with his hands, because the wind was blowing sand around. He opened His hands when the wind stopped."}, {"question_id": 159, "correctness": false, "substitution": "Fred covered his eyes with his hands, because the wind was blowing sand around. He lowered His eyes when the wind stopped."}, {"question_id": 159, "correctness": true, "substitution": "Fred covered his eyes with his hands, because the wind was blowing sand around. He lowered His hands when the wind stopped."}, {"substitution": "The actress used to be named tina, but she changed it to terpsichore a few years ago, because she figured tina was too hard to pronounce.", "correctness": true, "question_id": 160}, {"substitution": "The actress used to be named tina, but she changed it to terpsichore a few years ago, because she figured terpsichore was too hard to pronounce.", "correctness": false, "question_id": 160}, {"substitution": "The actress used to be named tina, but she changed it to terpsichore a few years ago, because she figured tina was easier to pronounce.", "correctness": false, "question_id": 161}, {"substitution": "The actress used to be named tina, but she changed it to terpsichore a few years ago, because she figured terpsichore was easier to pronounce.", "correctness": true, "question_id": 161}, {"substitution": "George watched tv while fred went out to buy groceries. after an hour george got up.", "correctness": true, "question_id": 162}, {"substitution": "George watched tv while fred went out to buy groceries. after an hour fred got up.", "correctness": false, "question_id": 162}, {"substitution": "George watched tv while fred went out to buy groceries. after an hour george got back.", "correctness": false, "question_id": 163}, {"substitution": "George watched tv while fred went out to buy groceries. after an hour fred got back.", "correctness": true, "question_id": 163}, {"question_id": 164, "correctness": true, "substitution": "Fred was supposed to run the dishwasher, but he put it off, because he wanted to watch TV. But the show turned out to be boring, so he changed his mind and turned The dishwasher on."}, {"question_id": 164, "correctness": false, "substitution": "Fred was supposed to run the dishwasher, but he put it off, because he wanted to watch TV. But the show turned out to be boring, so he changed his mind and turned The TV on."}, {"question_id": 165, "correctness": false, "substitution": "Fred was supposed to run the dishwasher, but he put it off, because he wanted to watch TV. But the show turned out to be boring, so he changed his mind and turned The dishwasher off."}, {"question_id": 165, "correctness": true, "substitution": "Fred was supposed to run the dishwasher, but he put it off, because he wanted to watch TV. But the show turned out to be boring, so he changed his mind and turned The TV off."}, {"question_id": 166, "correctness": true, "substitution": "Fred is the only man still alive who remembers my great-grandfather. Fred is a remarkable man."}, {"question_id": 166, "correctness": false, "substitution": "Fred is the only man still alive who remembers my great-grandfather. My great-grandfather is a remarkable man."}, {"question_id": 167, "correctness": false, "substitution": "Fred is the only man still alive who remembers my great-grandfather. Fred was a remarkable man."}, {"question_id": 167, "correctness": true, "substitution": "Fred is the only man still alive who remembers my great-grandfather. My great-grandfather was a remarkable man."}, {"question_id": 168, "correctness": true, "substitution": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, Fred was twelve years old."}, {"question_id": 168, "correctness": false, "substitution": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, My father was twelve years old."}, {"question_id": 169, "correctness": false, "substitution": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, Fred was twelve months old."}, {"question_id": 169, "correctness": true, "substitution": "Fred is the only man alive who still remembers my father as an infant. When Fred first saw my father, My father was twelve months old."}, {"substitution": "In july, yakutsk declared war on kamchatka. since kamchatka's army was much better equipped and ten times larger, yakutsk were defeated within weeks.", "correctness": true, "question_id": 170}, {"substitution": "In july, yakutsk declared war on kamchatka. since kamchatka's army was much better equipped and ten times larger, kamchatka were defeated within weeks.", "correctness": false, "question_id": 170}, {"substitution": "In july, yakutsk declared war on kamchatka. since kamchatka's army was much better equipped and ten times larger, yakutsk were victorious within weeks.", "correctness": false, "question_id": 171}, {"substitution": "In july, yakutsk declared war on kamchatka. since kamchatka's army was much better equipped and ten times larger, kamchatka were victorious within weeks.", "correctness": true, "question_id": 171}, {"question_id": 172, "correctness": true, "substitution": "Look! There is a minnow swimming right below that duck! The minnow had better get away to safety fast!"}, {"question_id": 172, "correctness": false, "substitution": "Look! There is a minnow swimming right below that duck! The duck had better get away to safety fast!"}, {"question_id": 173, "correctness": false, "substitution": "Look! There is a shark swimming right below that duck! The shark had better get away to safety fast!"}, {"question_id": 173, "correctness": true, "substitution": "Look! There is a shark swimming right below that duck! The duck had better get away to safety fast!"}, {"question_id": 174, "correctness": true, "substitution": "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. Archaeologists hunted for evidence on the river banks."}, {"question_id": 174, "correctness": false, "substitution": "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. Prehistoric humans hunted for evidence on the river banks."}, {"question_id": 175, "correctness": false, "substitution": "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. Archaeologists hunted for deer on the river banks."}, {"question_id": 175, "correctness": true, "substitution": "Archaeologists have concluded that humans lived in Laputa 20,000 years ago. Prehistoric humans hunted for deer on the river banks."}, {"question_id": 176, "correctness": true, "substitution": "The scientists are studying three species of fish that have recently been found living in the Indian Ocean. The scientists began two years ago."}, {"question_id": 176, "correctness": false, "substitution": "The scientists are studying three species of fish that have recently been found living in the Indian Ocean. The fish began two years ago."}, {"question_id": 177, "correctness": false, "substitution": "The scientists are studying three species of fish that have recently been found living in the Indian Ocean. The scientists appeared two years ago."}, {"question_id": 177, "correctness": true, "substitution": "The scientists are studying three species of fish that have recently been found living in the Indian Ocean. The fish appeared two years ago."}, {"question_id": 178, "correctness": true, "substitution": "The journalists interviewed the stars of the new movie. The journalists were very persistent, so the interview lasted for a long time."}, {"question_id": 178, "correctness": false, "substitution": "The journalists interviewed the stars of the new movie. The stars were very persistent, so the interview lasted for a long time."}, {"question_id": 179, "correctness": false, "substitution": "The journalists interviewed the stars of the new movie. The journalists were very cooperative, so the interview lasted for a long time."}, {"question_id": 179, "correctness": true, "substitution": "The journalists interviewed the stars of the new movie. The stars were very cooperative, so the interview lasted for a long time."}, {"question_id": 180, "correctness": true, "substitution": "The police arrested all of the gang members. The police were trying to stop the drug trade in the neighborhood."}, {"question_id": 180, "correctness": false, "substitution": "The police arrested all of the gang members. The gang members were trying to stop the drug trade in the neighborhood."}, {"question_id": 181, "correctness": false, "substitution": "The police arrested all of the gang members. The police were trying to run the drug trade in the neighborhood."}, {"question_id": 181, "correctness": true, "substitution": "The police arrested all of the gang members. The gang members were trying to run the drug trade in the neighborhood."}, {"question_id": 182, "correctness": true, "substitution": "I put the cake away in the refrigerator. The cake has a lot of butter in it."}, {"question_id": 182, "correctness": false, "substitution": "I put the cake away in the refrigerator. The refrigerator has a lot of butter in it."}, {"question_id": 183, "correctness": false, "substitution": "I put the cake away in the refrigerator. The cake has a lot of leftovers in it."}, {"question_id": 183, "correctness": true, "substitution": "I put the cake away in the refrigerator. The refrigerator has a lot of leftovers in it."}, {"question_id": 184, "correctness": true, "substitution": "Sam broke both his ankles and he's walking with crutches. But a month or so from now The ankles should be better."}, {"question_id": 184, "correctness": false, "substitution": "Sam broke both his ankles and he's walking with crutches. But a month or so from now The crutches should be better."}, {"question_id": 185, "correctness": false, "substitution": "Sam broke both his ankles and he's walking with crutches. But a month or so from now The ankles should be unnecessary."}, {"question_id": 185, "correctness": true, "substitution": "Sam broke both his ankles and he's walking with crutches. But a month or so from now The crutches should be unnecessary."}, {"question_id": 186, "correctness": true, "substitution": "When the sponsors of the bill got to the town hall, they were surprised to find that the room was full of opponents. The sponsors were very much in the minority."}, {"question_id": 186, "correctness": false, "substitution": "When the sponsors of the bill got to the town hall, they were surprised to find that the room was full of opponents. The opponents were very much in the minority."}, {"question_id": 187, "correctness": false, "substitution": "When the sponsors of the bill got to the town hall, they were surprised to find that the room was full of opponents. The sponsors were very much in the majority."}, {"question_id": 187, "correctness": true, "substitution": "When the sponsors of the bill got to the town hall, they were surprised to find that the room was full of opponents. The opponents were very much in the majority."}, {"substitution": "Everyone really loved the chocolate chip cookies; only a few people liked the oatmeal cookies. next time, we should make more of the chocolate chip cookies .", "correctness": true, "question_id": 188}, {"substitution": "Everyone really loved the chocolate chip cookies; only a few people liked the oatmeal cookies. next time, we should make more of the oatmeal cookies .", "correctness": false, "question_id": 188}, {"substitution": "Everyone really loved the chocolate chip cookies; only a few people liked the oatmeal cookies. next time, we should make fewer of the chocolate chip cookies .", "correctness": false, "question_id": 189}, {"substitution": "Everyone really loved the chocolate chip cookies; only a few people liked the oatmeal cookies. next time, we should make fewer of the oatmeal cookies .", "correctness": true, "question_id": 189}, {"question_id": 190, "correctness": true, "substitution": "We had hoped to place copies of our newsletter on all the chairs in the auditorium, but there were simply not enough of copies of the newsletter ."}, {"question_id": 190, "correctness": false, "substitution": "We had hoped to place copies of our newsletter on all the chairs in the auditorium, but there were simply not enough of chairs ."}, {"question_id": 191, "correctness": false, "substitution": "We had hoped to place copies of our newsletter on all the chairs in the auditorium, but there were simply too many of copies of the newsletter ."}, {"question_id": 191, "correctness": true, "substitution": "We had hoped to place copies of our newsletter on all the chairs in the auditorium, but there were simply too many of chairs ."}, {"question_id": 192, "correctness": true, "substitution": "I stuck a pin through a carrot. When I pulled the pin out, The pin left a hole."}, {"question_id": 192, "correctness": false, "substitution": "I stuck a pin through a carrot. When I pulled the pin out, The carrot left a hole."}, {"question_id": 193, "correctness": false, "substitution": "I stuck a pin through a carrot. When I pulled the pin out, The pin had a hole."}, {"question_id": 193, "correctness": true, "substitution": "I stuck a pin through a carrot. When I pulled the pin out, The carrot had a hole."}, {"question_id": 194, "correctness": true, "substitution": "I couldn't find a spoon, so I tried using a pen to stir my coffee. But that turned out to be a bad idea, because The pen got full of coffee."}, {"question_id": 194, "correctness": false, "substitution": "I couldn't find a spoon, so I tried using a pen to stir my coffee. But that turned out to be a bad idea, because The coffee got full of coffee."}, {"question_id": 195, "correctness": false, "substitution": "I couldn't find a spoon, so I tried using a pen to stir my coffee. But that turned out to be a bad idea, because The pen got full of ink."}, {"question_id": 195, "correctness": true, "substitution": "I couldn't find a spoon, so I tried using a pen to stir my coffee. But that turned out to be a bad idea, because The coffee got full of ink."}, {"substitution": "Fred follows steve's example in everything. fred admires him hugely.", "correctness": true, "question_id": 196}, {"substitution": "Fred follows steve's example in everything. steve admires him hugely.", "correctness": false, "question_id": 196}, {"substitution": "Fred follows steve's example in everything. fred influences him hugely.", "correctness": false, "question_id": 197}, {"substitution": "Fred follows steve's example in everything. steve influences him hugely.", "correctness": true, "question_id": 197}, {"question_id": 198, "correctness": true, "substitution": "The table won't fit through the doorway because The table is too wide."}, {"question_id": 198, "correctness": false, "substitution": "The table won't fit through the doorway because The doorway is too wide."}, {"question_id": 199, "correctness": false, "substitution": "The table won't fit through the doorway because The table is too narrow."}, {"question_id": 199, "correctness": true, "substitution": "The table won't fit through the doorway because The doorway is too narrow."}, {"substitution": "Grace was happy to trade me her sweater for my jacket. she thinks the jacket looks dowdy on her.", "correctness": true, "question_id": 200}, {"substitution": "Grace was happy to trade me her sweater for my jacket. she thinks the sweater looks dowdy on her.", "correctness": false, "question_id": 200}, {"substitution": "Grace was happy to trade me her sweater for my jacket. she thinks the jacket looks great on her.", "correctness": false, "question_id": 201}, {"substitution": "Grace was happy to trade me her sweater for my jacket. she thinks the sweater looks great on her.", "correctness": true, "question_id": 201}, {"substitution": "Bill hired john to take care of bill .", "correctness": true, "question_id": 202}, {"substitution": "Bill hired john to take care of john .", "correctness": false, "question_id": 202}, {"substitution": "Bill hired himself out to john to take care of bill .", "correctness": false, "question_id": 203}, {"substitution": "Bill hired himself out to john to take care of john .", "correctness": true, "question_id": 203}, {"substitution": "Bill promised john to leave, so an hour later bill left.", "correctness": true, "question_id": 204}, {"substitution": "Bill promised john to leave, so an hour later john left.", "correctness": false, "question_id": 204}, {"substitution": "Bill ordered john to leave, so an hour later bill left.", "correctness": false, "question_id": 205}, {"substitution": "Bill ordered john to leave, so an hour later john left.", "correctness": true, "question_id": 205}, {"substitution": "Sam xenophanes's biography of the spartan general goodman conveys a vivid sense of the difficulties xenophanes faced in his research.", "correctness": true, "question_id": 206}, {"substitution": "Sam xenophanes's biography of the spartan general goodman conveys a vivid sense of the difficulties goodman faced in his research.", "correctness": false, "question_id": 206}, {"substitution": "Sam xenophanes's biography of the spartan general goodman conveys a vivid sense of the difficulties xenophanes faced in his childhood.", "correctness": false, "question_id": 207}, {"substitution": "Sam xenophanes's biography of the spartan general goodman conveys a vivid sense of the difficulties goodman faced in his childhood.", "correctness": true, "question_id": 207}, {"question_id": 208, "correctness": true, "substitution": "Emma's mother had died long ago, and Emma education had been managed by an excellent woman as governess."}, {"question_id": 208, "correctness": false, "substitution": "Emma's mother had died long ago, and Emma's mother education had been managed by an excellent woman as governess."}, {"question_id": 209, "correctness": false, "substitution": "Emma's mother had died long ago, and Emma place had been taken by an excellent woman as governess."}, {"question_id": 209, "correctness": true, "substitution": "Emma's mother had died long ago, and Emma's mother place had been taken by an excellent woman as governess."}, {"substitution": "Susan knocked on jane's door but susan did not get an answer.", "correctness": true, "question_id": 210}, {"substitution": "Susan knocked on jane's door but jane did not get an answer.", "correctness": false, "question_id": 210}, {"substitution": "Susan knocked on jane's door but susan did not answer.", "correctness": false, "question_id": 211}, {"substitution": "Susan knocked on jane's door but jane did not answer.", "correctness": true, "question_id": 211}, {"question_id": 212, "correctness": true, "substitution": "Joe paid the detective after Joe received the final report on the case."}, {"question_id": 212, "correctness": false, "substitution": "Joe paid the detective after the detective received the final report on the case."}, {"question_id": 213, "correctness": false, "substitution": "Joe paid the detective after Joe delivered the final report on the case."}, {"question_id": 213, "correctness": true, "substitution": "Joe paid the detective after the detective delivered the final report on the case."}, {"substitution": "Sally didn't get angry with beth, who had cut her off, because sally stopped and counted to ten.", "correctness": true, "question_id": 214}, {"substitution": "Sally didn't get angry with beth, who had cut her off, because beth stopped and counted to ten.", "correctness": false, "question_id": 214}, {"substitution": "Sally didn't get angry with beth, who had cut her off, because sally stopped and apologized.", "correctness": false, "question_id": 215}, {"substitution": "Sally didn't get angry with beth, who had cut her off, because beth stopped and apologized.", "correctness": true, "question_id": 215}, {"question_id": 216, "correctness": true, "substitution": "Jim signaled the barman and gestured toward Jim empty glass"}, {"question_id": 216, "correctness": false, "substitution": "Jim signaled the barman and gestured toward The barman empty glass"}, {"question_id": 217, "correctness": false, "substitution": "Jim signaled the barman and gestured toward Jim bathroom key."}, {"question_id": 217, "correctness": true, "substitution": "Jim signaled the barman and gestured toward The barman bathroom key."}, {"substitution": "Bill took the rear seat while dan claimed the front because bill \"dibs!\" was slow.", "correctness": true, "question_id": 218}, {"substitution": "Bill took the rear seat while dan claimed the front because dan \"dibs!\" was slow.", "correctness": false, "question_id": 218}, {"substitution": "Bill took the rear seat while dan claimed the front because bill \"dibs!\" was quicker.", "correctness": false, "question_id": 219}, {"substitution": "Bill took the rear seat while dan claimed the front because dan \"dibs!\" was quicker.", "correctness": true, "question_id": 219}, {"substitution": "Ralph said \"check\" to tom as he moved ralph bishop.", "correctness": true, "question_id": 220}, {"substitution": "Ralph said \"check\" to tom as he moved tom bishop.", "correctness": false, "question_id": 220}, {"substitution": "Ralph said \"check\" to tom as he took ralph bishop.", "correctness": false, "question_id": 221}, {"substitution": "Ralph said \"check\" to tom as he took tom bishop.", "correctness": true, "question_id": 221}, {"substitution": "As susan in the crop duster passed over andrea, susan could see the landing strip.", "correctness": true, "question_id": 222}, {"substitution": "As susan in the crop duster passed over andrea, andrea could see the landing strip.", "correctness": false, "question_id": 222}, {"substitution": "As susan in the crop duster passed over andrea, susan could see the landing gear.", "correctness": false, "question_id": 223}, {"substitution": "As susan in the crop duster passed over andrea, andrea could see the landing gear.", "correctness": true, "question_id": 223}, {"substitution": "Ralph gave tom a lift to school so ralph wouldn't have to drive alone.", "correctness": true, "question_id": 224}, {"substitution": "Ralph gave tom a lift to school so tom wouldn't have to drive alone.", "correctness": false, "question_id": 224}, {"substitution": "Ralph gave tom a lift to school so ralph wouldn't have to walk.", "correctness": false, "question_id": 225}, {"substitution": "Ralph gave tom a lift to school so tom wouldn't have to walk.", "correctness": true, "question_id": 225}, {"substitution": "John passed the half-empty plate to bill because john was full.", "correctness": true, "question_id": 226}, {"substitution": "John passed the half-empty plate to bill because bill was full.", "correctness": false, "question_id": 226}, {"substitution": "John passed the half-empty plate to bill because john was hungry.", "correctness": false, "question_id": 227}, {"substitution": "John passed the half-empty plate to bill because bill was hungry.", "correctness": true, "question_id": 227}, {"substitution": "John passed the gameboy to bill because john turn was over.", "correctness": true, "question_id": 228}, {"substitution": "John passed the gameboy to bill because bill turn was over.", "correctness": false, "question_id": 228}, {"substitution": "John passed the gameboy to bill because john turn was next.", "correctness": false, "question_id": 229}, {"substitution": "John passed the gameboy to bill because bill turn was next.", "correctness": true, "question_id": 229}, {"substitution": "The boy lifted the man onto the boy shoulders.", "correctness": true, "question_id": 230}, {"substitution": "The boy lifted the man onto the man shoulders.", "correctness": false, "question_id": 230}, {"substitution": "The boy lifted the man onto the boy bunk bed.", "correctness": false, "question_id": 231}, {"substitution": "The boy lifted the man onto the man bunk bed.", "correctness": true, "question_id": 231}, {"question_id": 232, "correctness": true, "substitution": "Stretching The woman back, the woman smiled at the girl."}, {"question_id": 232, "correctness": false, "substitution": "Stretching The girl back, the woman smiled at the girl."}, {"question_id": 233, "correctness": false, "substitution": "Patting The woman back, the woman smiled at the girl."}, {"question_id": 233, "correctness": true, "substitution": "Patting The girl back, the woman smiled at the girl."}, {"substitution": "Toby cried because billy wouldn't accept toby toy.", "correctness": true, "question_id": 234}, {"substitution": "Toby cried because billy wouldn't accept billy toy.", "correctness": false, "question_id": 234}, {"substitution": "Toby cried because billy wouldn't share toby toy.", "correctness": false, "question_id": 235}, {"substitution": "Toby cried because billy wouldn't share billy toy.", "correctness": true, "question_id": 235}, {"substitution": "Donna spoke to lily, breaking donna silence.", "correctness": true, "question_id": 236}, {"substitution": "Donna spoke to lily, breaking lily silence.", "correctness": false, "question_id": 236}, {"substitution": "Donna spoke to lily, breaking donna concentration.", "correctness": false, "question_id": 237}, {"substitution": "Donna spoke to lily, breaking lily concentration.", "correctness": true, "question_id": 237}, {"substitution": "When timmy dropped his ice cream, tommy giggled, so father gave timmy a sympathetic look.", "correctness": true, "question_id": 238}, {"substitution": "When timmy dropped his ice cream, tommy giggled, so father gave tommy a sympathetic look.", "correctness": false, "question_id": 238}, {"substitution": "When timmy dropped his ice cream, tommy giggled, so father gave timmy a stern look.", "correctness": false, "question_id": 239}, {"substitution": "When timmy dropped his ice cream, tommy giggled, so father gave tommy a stern look.", "correctness": true, "question_id": 239}, {"substitution": "As tommy carried ollie up the long winding steps, tommy legs ached.", "correctness": true, "question_id": 240}, {"substitution": "As tommy carried ollie up the long winding steps, ollie legs ached.", "correctness": false, "question_id": 240}, {"substitution": "As tommy carried ollie up the long winding steps, tommy legs dangled.", "correctness": false, "question_id": 241}, {"substitution": "As tommy carried ollie up the long winding steps, ollie legs dangled.", "correctness": true, "question_id": 241}, {"question_id": 242, "correctness": true, "substitution": "The father carried the sleeping boy in The father arms"}, {"question_id": 242, "correctness": false, "substitution": "The father carried the sleeping boy in The boy arms"}, {"question_id": 243, "correctness": false, "substitution": "The father carried the sleeping boy in The father bassinet."}, {"question_id": 243, "correctness": true, "substitution": "The father carried the sleeping boy in The boy bassinet."}, {"question_id": 244, "correctness": true, "substitution": "The woman held the girl against The woman chest"}, {"question_id": 244, "correctness": false, "substitution": "The woman held the girl against The girl chest"}, {"question_id": 245, "correctness": false, "substitution": "The woman held the girl against The woman will."}, {"question_id": 245, "correctness": true, "substitution": "The woman held the girl against The girl will."}, {"question_id": 246, "correctness": true, "substitution": "Pam's parents came home and found her having sex with her boyfriend, Paul. Pam's parents were furious about it."}, {"question_id": 246, "correctness": false, "substitution": "Pam's parents came home and found her having sex with her boyfriend, Paul. Pam and Paul were furious about it."}, {"question_id": 247, "correctness": false, "substitution": "Pam's parents came home and found her having sex with her boyfriend, Paul. Pam's parents were embarrassed about it."}, {"question_id": 247, "correctness": true, "substitution": "Pam's parents came home and found her having sex with her boyfriend, Paul. Pam and Paul were embarrassed about it."}, {"question_id": 248, "correctness": true, "substitution": "Dr. Adams informed Kate that Dr. Adams had retired and presented several options for future treatment."}, {"question_id": 248, "correctness": false, "substitution": "Dr. Adams informed Kate that Kate had retired and presented several options for future treatment."}, {"question_id": 249, "correctness": false, "substitution": "Dr. Adams informed Kate that Dr. Adams had cancer and presented several options for future treatment."}, {"question_id": 249, "correctness": true, "substitution": "Dr. Adams informed Kate that Kate had cancer and presented several options for future treatment."}, {"substitution": "Bill had to stop dan from toying with the injured bird. bill is very compassionate.", "correctness": true, "question_id": 250}, {"substitution": "Bill had to stop dan from toying with the injured bird. dan is very compassionate.", "correctness": false, "question_id": 250}, {"substitution": "Bill had to stop dan from toying with the injured bird. bill is very cruel.", "correctness": false, "question_id": 251}, {"substitution": "Bill had to stop dan from toying with the injured bird. dan is very cruel.", "correctness": true, "question_id": 251}, {"substitution": "Eric got free tickets to the play, but he gave them to george, even though eric was particularly eager to see it.", "correctness": true, "question_id": 252}, {"substitution": "Eric got free tickets to the play, but he gave them to george, even though george was particularly eager to see it.", "correctness": false, "question_id": 252}, {"substitution": "Eric got free tickets to the play, but he gave them to george, because eric was particularly eager to see it.", "correctness": false, "question_id": 253}, {"substitution": "Eric got free tickets to the play, but he gave them to george, because george was particularly eager to see it.", "correctness": true, "question_id": 253}, {"substitution": "Eric got free tickets to the play, but he gave them to george, because eric was not particularly eager to see it.", "correctness": true, "question_id": 254}, {"substitution": "Eric got free tickets to the play, but he gave them to george, because george was not particularly eager to see it.", "correctness": false, "question_id": 254}, {"substitution": "Joan gave jane candy because joan wasn't hungry.", "correctness": true, "question_id": 255}, {"substitution": "Joan gave jane candy because jane wasn't hungry.", "correctness": false, "question_id": 255}, {"substitution": "Joan gave jane candy because joan was hungry.", "correctness": false, "question_id": 256}, {"substitution": "Joan gave jane candy because jane was hungry.", "correctness": true, "question_id": 256}, {"question_id": 257, "correctness": true, "substitution": "I tried to paint a picture of an orchard, with lemons in the lemon trees, but lemons came out looking more like light bulbs."}, {"question_id": 257, "correctness": false, "substitution": "I tried to paint a picture of an orchard, with lemons in the lemon trees, but lemon trees came out looking more like light bulbs."}, {"question_id": 258, "correctness": false, "substitution": "I tried to paint a picture of an orchard, with lemons in the lemon trees, but lemons came out looking more like telephone poles."}, {"question_id": 258, "correctness": true, "substitution": "I tried to paint a picture of an orchard, with lemons in the lemon trees, but lemon trees came out looking more like telephone poles."}, {"substitution": "Robert asked james for a favor but robert was refused.", "correctness": true, "question_id": 259}, {"substitution": "Robert asked james for a favor but james was refused.", "correctness": false, "question_id": 259}, {"substitution": "Robert asked james for a favor but robert refused.", "correctness": false, "question_id": 260}, {"substitution": "Robert asked james for a favor but james refused.", "correctness": true, "question_id": 260}, {"substitution": "Shatov ceded the presidency to kirilov because shatov was less popular.", "correctness": true, "question_id": 261}, {"substitution": "Shatov ceded the presidency to kirilov because kirilov was less popular.", "correctness": false, "question_id": 261}, {"substitution": "Shatov ceded the presidency to kirilov because shatov was more popular.", "correctness": false, "question_id": 262}, {"substitution": "Shatov ceded the presidency to kirilov because kirilov was more popular.", "correctness": true, "question_id": 262}, {"substitution": "Janie did not pass the ball to emma although janie saw that she was open.", "correctness": true, "question_id": 263}, {"substitution": "Janie did not pass the ball to emma although emma saw that she was open.", "correctness": false, "question_id": 263}, {"substitution": "Janie did not pass the ball to emma although janie was open.", "correctness": false, "question_id": 264}, {"substitution": "Janie did not pass the ball to emma although emma was open.", "correctness": true, "question_id": 264}, {"question_id": 265, "correctness": true, "substitution": "I put the butterfly wing on the table and The butterfly wing broke."}, {"question_id": 265, "correctness": false, "substitution": "I put the butterfly wing on the table and The table broke."}, {"question_id": 266, "correctness": false, "substitution": "I put the heavy book on the table and The heavy book broke."}, {"question_id": 266, "correctness": true, "substitution": "I put the heavy book on the table and The table broke."}, {"question_id": 267, "correctness": true, "substitution": "Madonna fired her trainer because Madonna couldn't stand her boyfriend."}, {"question_id": 267, "correctness": false, "substitution": "Madonna fired her trainer because The trainer couldn't stand her boyfriend."}, {"question_id": 268, "correctness": false, "substitution": "Madonna fired her trainer because Madonna slept with her boyfriend."}, {"question_id": 268, "correctness": true, "substitution": "Madonna fired her trainer because The trainer slept with her boyfriend."}, {"question_id": 269, "correctness": true, "substitution": "Madonna fired her trainer because she slept with Madonna boyfriend."}, {"question_id": 269, "correctness": false, "substitution": "Madonna fired her trainer because she slept with The trainer boyfriend."}, {"question_id": 270, "correctness": false, "substitution": "Madonna fired her trainer because she couldn't stand Madonna boyfriend."}, {"question_id": 270, "correctness": true, "substitution": "Madonna fired her trainer because she couldn't stand The trainer boyfriend."}, {"substitution": "Rebecca believed that carol suspected that rebecca had stolen the watch.", "correctness": true, "question_id": 271}, {"substitution": "Rebecca believed that carol suspected that carol had stolen the watch.", "correctness": false, "question_id": 271}, {"substitution": "Rebecca believed that carol regretted that rebecca had stolen the watch.", "correctness": false, "question_id": 272}, {"substitution": "Rebecca believed that carol regretted that carol had stolen the watch.", "correctness": true, "question_id": 272}]